{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing a pricing-section update and its related file and components.",
  "frontend-file-summaries.txt": "Text file listing short summaries of multiple frontend source files.",
  "frontend/index.css": "Tailwind base and dark theme variable definitions with OKLCH color tokens and global styles.",
  "frontend/index.html": "HTML entry point enabling dark mode and mounting the React app.",
  "frontend/src/App.tsx": "Top-level React component composing header and all marketing sections.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Responsive header with branding, smooth-scroll navigation, and mobile menu logic.",
  "frontend/src/components/marketing/ScrollToSection.ts": "Utility for smooth scrolling to section anchors with header offset.",
  "frontend/src/components/marketing/Sections.tsx": "All marketing sections including hero, services, process, pricing with $50 deposit note, example, about, and contact.",
  "frontend/src/components/marketing/ThemeTokens.ts": "Centralized constants for spacing, container sizing, gradients, and neon shadow presets.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hooks for managing Internet Identity login, stored identities, and auth state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks; currently unused.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables, base typography, neon utility classes, and custom scrollbars for a dark neon theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom OKLCH-based colors, animations, shadows, and plugin integrations.",
  "project_state.json": "Stores project metadata, including existing features and a pending request to add a $50 deposit note under pricing plans."
}