{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report linking a styling update to the landing page CTA button with related files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark mode with custom OKLCH color tokens.",
  "frontend/index.html": "HTML entry point setting dark theme, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Main React component assembling header and all marketing sections.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Responsive navigation bar with scroll-based styling, mobile menu, and smooth section navigation.",
  "frontend/src/components/marketing/ScrollToSection.ts": "Utility for smooth scrolling to sections with fixed-header offset.",
  "frontend/src/components/marketing/Sections.tsx": "Marketing section components including Hero with bold white CTA button and themed content blocks.",
  "frontend/src/components/marketing/ThemeTokens.ts": "Shared theme constants for spacing, container styles, gradients, and neon shadow presets.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor, updating when Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for managing Internet Identity authentication state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind layers, global styles, and a neon dark theme using CSS variables, plus custom utilities like neon glow and scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions, neon-themed colors, custom shadows, animations, and plugin integrations.",
  "project_state.json": "Stores the project’s current state, including summary, requirements, architectural notes, known issues, and existing features."
}