{
  "kind": "build_request",
  "title": "Add $50 deposit note with brief reasoning under each pricing plan",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Pricing section, add a short note under each pricing plan (Basic, Standard, Premium) that states “$50 deposit required” and includes a brief, clear reason (e.g., that the deposit covers initial work like creating a website preview/prototype before full development). Use English for the new user-facing copy and keep the note visually subordinate to the plan description (small text / muted styling) while still readable in the dark theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "under each pricing plan write smth like $50 deposit required and add some shirt reasoning like to build website preview ect..."
        ]
      },
      "acceptanceCriteria": [
        "Each of the three pricing cards (Basic, Standard, Premium) displays the exact phrase “$50 deposit required”.",
        "Each pricing card includes 1 short sentence of reasoning next to or below the deposit phrase (e.g., mentions building a website preview/prototype).",
        "The deposit note is displayed consistently across all plans and does not break the existing layout on mobile or desktop.",
        "No backend changes are introduced."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Keep all user-facing text in English for this change."
  ],
  "nonGoals": [
    "Implementing payments, invoicing, or deposit collection flows.",
    "Changing plan prices, plan names, or existing feature bullet lists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}